#+TITLE: Herramientas CLI
#+AUTHOR: Miguel Angel Escalante Serrato
#+EMAIL:  miguel.escalante@itam.mx
#+DATE: 26-Oct-2020
#+LANGUAGE:  es
#+OPTIONS: num:nil toc:nil
#+REVEAL_THEME: moon
#+REVEAL_ROOT: https://cdn.jsdelivr.net/npm/reveal.js
#+REVEAL_TRANS: cube
#+REVEAL_SLIDE_NUMBER: t
#+REVEAL_HEAD_PREAMBLE: <meta name="description" content="Estadística Computacional">

* cut

Es un programa que toma un caracter que mandemos en el parámetro =-d= y lo imprime a STDOUT.

** Bytes
#+begin_src shell
cat test.log | cut -b 1-2> test-out.log
#+end_src

#+RESULTS:

** characters

#+begin_src shell
  echo "lol,lel,lil,lul,lal" | cut -c 2-10
#+end_src

#+RESULTS:
| ol | lel | li |

** Delimiter, Field.
=-d=  nos dice qué caracter usaremos para hacer los cortes, y el parámetro =-f= nos dice con qué columnas nos quedaremos.

#+begin_src shell
echo "lol,lel,lil,lul,lal" | cut -d ',' -f5
#+end_src

#+RESULTS:
: lal

#+begin_src shell
echo "lol,lel,lil,lul,lal" | cut -d ','  -f 4,5,1,2
#+end_src

#+RESULTS:
| lol | lel | lul | lal |

#+begin_src shell
echo "lol,lel,lil,lul,lal" | cut -d ','  -f 1-4
#+end_src

#+RESULTS:
| lol | lel | lil | lul |


** Complement

Nos da el complemento de las columnas que mandemos :
#+begin_src shell
echo "lol,lel,lil,lul,lal" | cut --complement  -d ',' -f 1,2,3
#+end_src

#+RESULTS:
| lul | lal |


** Output Delimiter:
#+begin_src shell
echo "lol,lel,lil,lul,lal" | cut --complement  -d ',' -f 1 --output-delimiter="@"
#+end_src

#+RESULTS:
: lel@lil@lul@lal

#+begin_src shell
  cat test.log | cut -d' ' -f 3 | cut -d ':' -f 1| sort | uniq > ejercicio.log
#+end_src

#+RESULTS:

** Bytes
#+begin_src shell
cat test.log | cut -b 1-2 > test-out.log
#+end_src

#+RESULTS:

* sed
Stream Editor, es un editor de texto /on-the-go/, el uso más común es reemplazar textos, pero puede hacer mucho más.

** Sustitución.

#+begin_src shell
  cat kernel.log | sed 's/Bluetooth/@HOLA@/g' > result.log
#+end_src

#+RESULTS:

** Reemplazar la n-ésima ocurrencia en un archivo.
Sed trabaja línea a línea por lo que para poder reemplazar la n-ésima ocurrencia de un texto, lo hace a nivel línea.
#+begin_src shell
  cat kernel.log | sed 's/:/@HOLA@/1' > result.log
#+end_src

#+RESULTS:

concatenando comandos:
#+begin_src shell
  cat kernel.log | sed 's/:/@HOLA@/2g' > result.log
#+end_src

#+RESULTS:


** Elegit una línea particular a sustituír.

#+begin_src shell

  cat kernel.log | sed '3 s/:/@HOLA@/g' > result.log
#+end_src

#+RESULTS:

#+begin_src shell
  sed '3 s/:/@HOLA/g' kernel.log > result.log
#+end_src

#+RESULTS:

#+begin_src shell
  sed '3 s/:/@HOLA@/3g' < kernel.log > result.log
#+end_src

#+RESULTS:

** Doble o nada :P
la bandera =p= al final permite que se reimprima la línea en la cual se sustituyó el texto encontrado, ojo que si encuentra varias sustituciones sólo la repite una vez.

#+begin_src shell
  echo `wc -l kernel.log`
  sed 's/:/@HOLA@/p' < kernel.log > result.log
  echo `wc -l result.log`
#+end_src

#+RESULTS:
|  6022 | kernel.log |
| 12044 | result.log |


A menos que sólo quieras generar la impresión de sólo las que tuvieron sustitución.
#+begin_src shell
  echo `wc -l kernel.log`
  sed -n '3 s/:/@HOLA@/p' < kernel.log > result.log
  echo `wc -l result.log`
#+end_src

#+RESULTS:
| 6022 | kernel.log |
|    1 | result.log |

** Rangos sobre las sustituciones
#+begin_src shell
  echo `wc -l kernel.log`
  sed -n '10,$ s/:/@HOLA@/p' < kernel.log > result.log
  echo `wc -l result-3.log`
#+end_src

#+RESULTS:
: 6022 kernel.log


**  Borrado de líneas!
*** Podemos borrar una línea del archivo.
#+begin_src shell
  echo `wc -l kernel.log`
  sed  '1d' < kernel.log > result-d.log
  echo `wc -l result-d.log`
#+end_src

#+RESULTS:
| 6022 | kernel.log   |
| 6021 | result-d.log |


*** O la última:
#+begin_src shell
  echo `wc -l kernel.log`
  sed  '$d' < kernel.log > result-d.log
  echo `wc -l result-d.log`
#+end_src

#+RESULTS:
| 6022 | kernel.log   |
| 6021 | result-d.log |

*** O un rango:
#+begin_src shell
  echo `wc -l kernel.log`
  sed  '1,10d' < kernel.log > result-d.log
  echo `wc -l result-d.log`
#+end_src

#+RESULTS:
| 6022 | kernel.log   |
| 6012 | result-d.log |

*** O de la n-ésima a la última:
#+begin_src shell
  echo `wc -l kernel.log`
  sed  '501,$d' < kernel.log > result-d.log
  echo `wc -l result-d.log`
#+end_src

#+RESULTS:
| 6022 | kernel.log   |
|  500 | result-d.log |

*** O borramos dado un patrón.
#+begin_src shell
  echo `wc -l kernel.log`
  sed  '/Bluetooth/d' < kernel.log > result-d.log
  echo `wc -l result-d.log`
#+end_src

#+RESULTS:
| 6022 | kernel.log   |
| 5838 | result-d.log |

* grep / regex
** ¿Qué es una expresión regular?
Son una serie de caracteres que especifican patrones. Se usan para hacer búsquedas en textos para extraer diferentes características de los mismos.
OJO: veremos las bases del lenguaje, ya que hay demasiado material para todo lo que se puede hacer con Regex

| Utility | Regular Expression Type   |
| -       | -                         |
| vi      | Basic                     |
| grep    | Basic                     |
| awk     | Extended                  |
| Emacs   | EMACS Regular Expressions |
| PERL    | PERL Regular Expressions  |

** Caracteres Ancla
Los caracteres ancla, son caracteres que nos indican por ejemplo el inicio o fin de una línea:
+ =$= es el caracter para el fin de línea.
+ =^= es el caracter lara el inicio de línea.
#+begin_src shell
  wc -l kernel.log
  grep "Sep 28" kernel.log | wc -l
  grep "^Wed" kernel.log | wc -l
  grep "^Thu" kernel.log | wc -l
  grep "0$" kernel.log | wc -l
#+end_src


** "."
El "." hace match con cualquier caracter.
Nos filtra todos los renglones que tienen sólo un caracter.
#+begin_src shell
grep "^.$" kernel.log | wc -l
#+end_src

** Rangos de caracteres.
Puedes hacer filtros con diferentes patrones al encerrarlos en =[]=.
¿Qué hace este filtro?

#+begin_src shell
grep "^[0-9]$" kernel.log | wc -l
#+end_src


Podemos usar el guión para establecer rangos
#+begin_src shell
 grep "^[3-9]$" kernel.log | wc -l
#+end_src


Funciona también con letras:
#+begin_src shell
grep "^[abcdeT]$" kernel.log | wc -l
#+end_src

Y rangos de letras también:
#+begin_src shell
grep "^[a-z]$" kernel.log | wc -l
#+end_src

Ojo que hay diferencias con las letras mayúsculas:

#+begin_src shell
  grep "^[A-Z]$" kernel.log | wc -l
  grep "^[A-Za-z]$" kernel.log | wc -l
  grep "^[A-Za-z0-9]$" kernel.log | wc -l
  grep "^[A-Za-z0-9_\.]$" kernel.log | wc -l
#+end_src

** Excepciones
Líneas con un sólo caracter excepto este set:
#+begin_src shell
  grep "^[^A-Z]$" kernel.log | wc -l
  grep "^[^A-Z_]$" kernel.log | wc -l
  grep "^[^A-Z0-9xs]$" kernel.log | wc -l
#+end_src


** Repetición:
podemos pedir que un cierto caracter (o grupo de caracteres se repita cero o más veces).
#+begin_src shell
  grep "^[A-Za-z]*$" kernel.log | wc -l
#+end_src

es importante que en este caso el =*= no es lo mismo que en los wildcards de cuando listamos archivos
#+begin_src shell
  ls re*.log
#+end_src

** Número de ocurrencias.
delimitar el número de ocurrencias.
#+begin_src shell
  grep "^[A-Z]\{2,2\}$" kernel.log | wc -l
  grep "^[A-Z].*" kernel.log | wc -l
#+end_src

** Matcheo de palabras.

#+begin_src shell
  grep "\<[Tt]ue\>" kernel.log | wc -l
  grep "Thu\{0,1\}\<[Tt]ue\>\{0,1\}" kernel.log | wc -l
  grep "\<[TW][ehu][deu]\>" kernel.log | wc -l

#+end_src

* CRON
[[https://skalas.me/first-cron][Checar este link, #shamelesSelf-promotion.]]

* Awk
** Intro
Awk es un programa que es excelente para el manejo de información. Como =sed=  y =grep= es una función que ayuda a filtrar. Está en la mayoría de los sistemas UNIX-like.

Como los programas que hemos visitado, =awk= toma información del /stream/ de datos o algún archivo, para ejecutar sus funciones, por ende, tambien se puede hacer parte de un pipeline.

En principio se pensó para programas de una línea (lol), pero es un lenguaje Turing-completo y se pueden hacer scripts bastante complejos.

AWK se creó en los laboratorios Bell y su nombre viene de los nombres de sus creadores:
- Alfred Aho
- Peter Weinberger
- Brian Kernighan

** Estructura
la estructura base del programa en awk es :
 - patrón {acción}

#+begin_src shell
  awk 'BEGIN { print "START" }
             { print         }
       END   { print "STOP"  }'
#+end_src

** Basico
*** Comando Print

#+begin_src shell
ps | awk '{print}'
#+end_src

#+RESULTS:
|   PID | TTY |     TIME | CMD             |           |
|  3649 | ?   | 00:00:00 | systemd         |           |
|  3650 | ?   | 00:00:00 | (sd-pam)        |           |
|  3660 | ?   | 00:00:57 | pipewire        |           |
|  3663 | ?   | 00:00:02 | wireplumber     |           |
|  3665 | ?   | 00:00:00 | pipewire        |           |
|  3667 | ?   | 00:01:33 | pipewire-pulse  |           |
|  3670 | ?   | 00:00:00 | gnome-keyring-d |           |
|  3671 | ?   | 00:00:00 | dbus-broker-lau |           |
|  3675 | ?   | 00:00:01 | dbus-broker     |           |
|  3678 | ?   | 00:00:00 | gvfsd           |           |
|  3683 | ?   | 00:00:00 | gvfsd-fuse      |           |
|  3704 | ?   | 00:00:01 | tracker-miner-f |           |
|  3712 | ?   | 00:00:00 | gvfs-udisks2-vo |           |
|  3717 | ?   | 00:00:00 | gvfs-mtp-volume |           |
|  3721 | ?   | 00:00:00 | gvfs-gphoto2-vo |           |
|  3726 | ?   | 00:00:00 | gvfs-goa-volume |           |
|  3729 | ?   | 00:00:06 | goa-daemon      |           |
|  3735 | ?   | 00:00:00 | goa-identity-se |           |
|  3740 | ?   | 00:00:00 | gvfs-afc-volume |           |
|  3757 | ?   | 00:00:00 | gnome-keyring-d |           |
|  3923 | ?   | 00:00:00 | at-spi-bus-laun |           |
|  3928 | ?   | 00:00:00 | dbus-broker-lau |           |
|  3929 | ?   | 00:00:00 | dbus-broker     |           |
|  3939 | ?   | 00:00:00 | gnome-session-c |           |
|  3950 | ?   | 00:00:00 | gnome-session-b |           |
|  3969 | ?   | 00:06:26 | gnome-shell     |           |
|  3988 | ?   | 00:00:00 | xdg-permission- |           |
|  3992 | ?   | 00:00:00 | gnome-shell-cal |           |
|  4000 | ?   | 00:00:00 | evolution-sourc |           |
|  4006 | ?   | 00:00:00 | dconf-service   |           |
|  4009 | ?   | 00:00:00 | gvfsd-metadata  |           |
|  4023 | ?   | 00:00:04 | evolution-calen |           |
|  4053 | ?   | 00:00:00 | evolution-addre |           |
|  4056 | ?   | 00:00:00 | gvfsd-trash     |           |
|  4079 | ?   | 00:00:00 | xdg-desktop-por |           |
|  4083 | ?   | 00:00:00 | xdg-document-po |           |
|  4092 | ?   | 00:00:01 | xdg-desktop-por |           |
|  4107 | ?   | 00:00:01 | at-spi2-registr |           |
|  4108 | ?   | 00:00:00 | gjs             |           |
|  4130 | ?   | 00:00:00 | sh              |           |
|  4131 | ?   | 00:00:00 | gsd-a11y-settin |           |
|  4133 | ?   | 00:00:14 | ibus-daemon     |           |
|  4134 | ?   | 00:00:00 | gsd-color       |           |
|  4136 | ?   | 00:00:00 | gsd-datetime    |           |
|  4138 | ?   | 00:00:00 | gsd-housekeepin |           |
|  4139 | ?   | 00:00:00 | hidpi-daemon    |           |
|  4143 | ?   | 00:00:00 | gsd-keyboard    |           |
|  4145 | ?   | 00:00:00 | gsd-media-keys  |           |
|  4149 | ?   | 00:00:00 | gsd-power       |           |
|  4150 | ?   | 00:00:00 | gsd-print-notif |           |
|  4152 | ?   | 00:00:00 | gsd-rfkill      |           |
|  4156 | ?   | 00:00:00 | gsd-screensaver |           |
|  4158 | ?   | 00:00:01 | gsd-sharing     |           |
|  4159 | ?   | 00:00:00 | gsd-smartcard   |           |
|  4161 | ?   | 00:00:00 | gsd-sound       |           |
|  4162 | ?   | 00:00:00 | gsd-wacom       |           |
|  4165 | ?   | 00:00:00 | gsd-xsettings   |           |
|  4181 | ?   | 00:00:00 | evolution-alarm |           |
|  4186 | ?   | 00:00:00 | hidpi-notificat |           |
|  4189 | ?   | 00:00:42 | io.elementary.a |           |
|  4200 | ?   | 00:00:00 | touchegg        |           |
|  4212 | ?   | 00:00:00 | ibus-memconf    |           |
|  4229 | ?   | 00:00:04 | ibus-extension- |           |
|  4234 | ?   | 00:00:00 | gsd-disk-utilit |           |
|  4238 | ?   | 00:00:02 | ibus-x11        |           |
|  4241 | ?   | 00:00:02 | ibus-portal     |           |
|  4287 | ?   | 00:00:00 | gsd-printer     |           |
|  4322 | ?   | 00:00:31 | dropbox         |           |
|  4396 | ?   | 00:00:03 | ibus-engine-sim |           |
|  4401 | ?   | 00:00:00 | gjs             |           |
|  4404 | ?   | 00:00:00 | xdg-desktop-por |           |
|  4510 | ?   | 00:00:07 | gjs             |           |
|  4687 | ?   | 00:00:00 | pop-system-upda |           |
| 21677 | ?   | 00:00:01 | gnome-terminal- |           |
| 21764 | ?   | 00:00:00 | ssh-agent       |           |
| 23660 | ?   | 00:06:15 | opera           |           |
| 23665 | ?   | 00:00:00 | opera           |           |
| 23666 | ?   | 00:00:00 | opera           |           |
| 23668 | ?   | 00:00:00 | opera           |           |
| 23690 | ?   | 00:53:43 | opera           |           |
| 23696 | ?   | 00:02:14 | opera           |           |
| 23706 | ?   | 00:00:01 | opera           |           |
| 23714 | ?   | 00:00:01 | opera           |           |
| 23787 | ?   | 00:00:01 | opera           |           |
| 23801 | ?   | 00:00:03 | opera           |           |
| 23822 | ?   | 00:00:05 | opera           |           |
| 23824 | ?   | 00:04:00 | opera           |           |
| 23855 | ?   | 00:00:17 | opera           |           |
| 23863 | ?   | 00:00:27 | opera           |           |
| 23923 | ?   | 00:01:26 | opera           |           |
| 23955 | ?   | 00:00:20 | opera           |           |
| 23969 | ?   | 00:00:04 | opera           |           |
| 24000 | ?   | 00:00:04 | opera           |           |
| 24098 | ?   | 00:00:04 | opera           |           |
| 24785 | ?   | 00:03:51 | opera           |           |
| 25163 | ?   | 00:00:00 | bwrap           |           |
| 25171 | ?   | 00:00:00 | flatpak-session |           |
| 25186 | ?   | 00:00:00 | p11-kit-server  |           |
| 25208 | ?   | 00:00:00 | bwrap           |           |
| 25211 | ?   | 00:00:00 | xdg-dbus-proxy  |           |
| 25230 | ?   | 00:00:00 | bwrap           |           |
| 25270 | ?   | 00:00:27 | slack           |           |
| 25284 | ?   | 00:00:00 | cat             |           |
| 25285 | ?   | 00:00:00 | cat             |           |
| 25288 | ?   | 00:00:00 | flatpak-portal  |           |
| 25294 | ?   | 00:00:00 | slack           |           |
| 25296 | ?   | 00:00:00 | zypak-sandbox   | <defunct> |
| 25298 | ?   | 00:00:00 | bwrap           |           |
| 25307 | ?   | 00:00:00 | bwrap           |           |
| 25308 | ?   | 00:00:00 | slack           |           |
| 25327 | ?   | 00:00:00 | chrome_crashpad |           |
| 25341 | ?   | 00:01:21 | slack           |           |
| 25349 | ?   | 00:00:04 | slack           |           |
| 25364 | ?   | 00:00:00 | slack           |           |
| 25374 | ?   | 00:03:57 | slack           |           |
| 25391 | ?   | 00:00:00 | p11-kit-remote  |           |
| 25764 | ?   | 00:00:01 | slack           |           |
| 26202 | ?   | 00:00:43 | opera           |           |
| 28564 | ?   | 00:29:27 | opera           |           |
| 30941 | ?   | 00:00:00 | gvfsd-network   |           |
| 30956 | ?   | 00:00:00 | gvfsd-dnssd     |           |
| 31300 | ?   | 00:00:06 | eog             |           |
| 34920 | ?   | 00:00:00 | gnome-terminal  |           |
| 34923 | ?   | 00:00:00 | gnome-terminal. |           |
| 35894 | ?   | 00:00:00 | opera           |           |
| 36158 | ?   | 00:00:27 | emacs28         |           |
| 36352 | ?   | 00:00:00 | ssh-agent       |           |
| 37119 | ?   | 00:00:00 | bwrap           |           |
| 37131 | ?   | 00:00:00 | bwrap           |           |
| 37132 | ?   | 00:00:00 | xdg-dbus-proxy  |           |
| 37134 | ?   | 00:00:00 | bwrap           |           |
| 37135 | ?   | 00:00:00 | discord         |           |
| 37136 | ?   | 00:00:00 | socat           |           |
| 37140 | ?   | 00:00:09 | Discord         |           |
| 37143 | ?   | 00:00:00 | cat             |           |
| 37144 | ?   | 00:00:00 | cat             |           |
| 37150 | ?   | 00:00:00 | Discord         |           |
| 37152 | ?   | 00:00:00 | zypak-sandbox   | <defunct> |
| 37155 | ?   | 00:00:00 | bwrap           |           |
| 37163 | ?   | 00:00:00 | bwrap           |           |
| 37164 | ?   | 00:00:00 | Discord         |           |
| 37191 | ?   | 00:00:16 | Discord         |           |
| 37205 | ?   | 00:00:01 | Discord         |           |
| 37225 | ?   | 00:00:00 | Discord         |           |
| 37258 | ?   | 00:00:00 | p11-kit-remote  |           |
| 37260 | ?   | 00:01:02 | Discord         |           |
| 37300 | ?   | 00:00:00 | Discord         |           |
| 38226 | ?   | 00:00:00 | emacsql-sqlite  |           |
| 38964 | ?   | 00:00:09 | opera           |           |
| 39005 | ?   | 00:00:08 | opera           |           |
| 39035 | ?   | 00:00:04 | opera           |           |
| 39048 | ?   | 00:00:00 | opera           |           |
| 39090 | ?   | 00:00:00 | opera           |           |
| 39122 | ?   | 00:00:02 | opera           |           |
| 39144 | ?   | 00:00:00 | opera           |           |
| 39568 | ?   | 00:00:00 | opera           |           |
| 39721 | ?   | 00:00:00 | zsh             |           |
| 39722 | ?   | 00:00:00 | ps              |           |
| 39723 | ?   | 00:00:00 | awk             |           |

*** Print Cols
#+begin_src shell
  ps | awk '{print $2}'
#+end_src

#+RESULTS:
| TTY |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |
| ?   |


*** Delimitadores

#+begin_src shell
  cat /etc/passwd | awk -F ":" '{print $5}'
#+end_src



*** Print enhanced.

**** Diferentes columnas
#+begin_src shell
ps -a | awk '{print $1 $2 $3}'
#+end_src

**** Delimitador de salida
#+begin_src shell
ps -a | awk '{print $1" "$2" "$3}'
#+end_src


**** Delimitador de salida a priori
#+begin_src shell
awk 'BEGIN{FS="/"; OFS="----"} {print $2, $6, $7}' /etc/passwd
#+end_src


*** Busqueda
#+begin_src shell
  cat /etc/shells | awk -F "/" '/^\// {print $NF}'
#+end_src


**** Ejemplo Anterior:
#+begin_src shell
  cat /etc/passwd | awk -F':' '/^[a-z_]/ {print $1"-"$3}'
#+end_src

***  Operaciones básicas
#+begin_src shell
df -h | awk '/\/dev/ {print $1"\t"$2"\t"$3}'
#+end_src

#+begin_src shell
df -h | awk '/\/dev/ {print $1"\t"$2+$3}'
#+end_src

#+begin_src shell
df | awk '/\/dev/ {print $1"-"$2-$3}'
#+end_src

*** line length
#+begin_src shell
  cat /etc/shells | awk 'length($0) <10'
#+end_src

*** Ifs!!!
#+begin_src shell
  ps -ef | awk '{if ($NF == "/bin/zsh") print $0} '
#+end_src

*** For.
#+begin_src shell
awk 'BEGIN { for (i=1; i<=10; i++) print "El cuadrado de ", i, "es",i*i;}'
#+end_src

#+RESULTS:
| El | cuadrado | de |  1 | es |   1 |
| El | cuadrado | de |  2 | es |   4 |
| El | cuadrado | de |  3 | es |   9 |
| El | cuadrado | de |  4 | es |  16 |
| El | cuadrado | de |  5 | es |  25 |
| El | cuadrado | de |  6 | es |  36 |
| El | cuadrado | de |  7 | es |  49 |
| El | cuadrado | de |  8 | es |  64 |
| El | cuadrado | de |  9 | es |  81 |
| El | cuadrado | de | 10 | es | 100 |

*** Rangos
#+begin_src shell
  df | awk 'NR==3, NR==5 {print NR, $0}'
#+end_src

*** numero de líneas
#+begin_src shell
  awk 'END {print NR}' /etc/passwd
  wc -l /etc/passwd
#+end_src

*** Cuenta las palabras
#+begin_src shell
  awk 'BEGIN {
      FS="[^a-zA-Z]+"
  }
  {
      for (i=1; i<=NF; i++)
          words[tolower($i)]++
  }
  END {
      for (i in words)
          print i, words[i]
  }' test.log
#+end_src

** Scripts
*** Shell
#+begin_src shell
#!/bin/sh
awk '
BEGIN { for (i=1; i<=10; i++) print "El cuadrado de ", i, "es",i*i;}
'
#+end_src

*** awk

#+begin_src shell :tangle ./cuadrado.awk
#!/usr/bin/awk
BEGIN { for (i=1; i<=10; i++) print "El cuadrado de ", i, "es",i*i;}
#+end_src

#+begin_src shell
 awk -f cuadrado.awk
#+end_src

*** Otro ejemplo

#+begin_src shell :tangle ./fileowner.awk
#!/usr/bin/awk
BEGIN { print "File\tOwner" }
{ print $9, "\t", $3}
END { }
#+end_src

#+RESULTS:

#+begin_src shell
   ls -la | awk -f fileowner.awk
#+end_src
